Revit 2027 API
Family.IsCurtainPanelFamily Property
 Whether the Family is a Curtain Panel family. Curtain Panel family symbols are used as the ObjectTypes of DividedSurface elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCurtainPanelFamily { get; }
Public ReadOnly Property IsCurtainPanelFamily As Boolean
	Get
public:
property bool IsCurtainPanelFamily {
	bool get ();
}
member IsCurtainPanelFamily : bool with get
Property Value
Boolean
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace